---
kind: property
id: P:Autodesk.Revit.DB.ExternalDefinitionCreationOptions.Name
source: html/e53f799e-fd7b-04b3-1a01-767896d6f89f.htm
---
# Autodesk.Revit.DB.ExternalDefinitionCreationOptions.Name Property

The name of the parameter definition to be created.

## Syntax (C#)
```csharp
public string Name { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null